{"/press/young-people-not-permitted-be-party-political-wales-pirates-think-differently": {"state": "full", "title": "Young people not permitted to be party political in Wales - Pirates think differently", "body": "\n\n\n\n If you live in Wales, are aged 11-18 and want to take part in the Welsh Youth Parliament you will not be allowed to disclose your party affiliation.\n \n\n\n\n The Welsh Government announced the end to their consultation in November 2017 and have decided on the particulars surrounding the Welsh Youth Parliament, despite never publishing the results of the consultation.\n \n\n\n\n Those aged 11-18 are permitted to take part, the first elections will be November 2018 and there will be 60 members but none are allowed to disclose their party association(s). Indeed it is unclear if any register of declarations, such as for union membership, or any other affliation will be permitted.\n \n\n\n\n It is also unclear if anything discussed within the WYP will be considered by the actual Welsh Parliament in the Senedd - for instance a law currently being considered would ban those under 18 from getting certain piercings.\n \n\n\n\n Pirate Party UK Principal Spokesperson, Mark Chapman said:\n \n\n\n\n \"This is yet another example of lazy and inconsistent thinking by the Welsh Government. On one hand they're saying under 18s cannot decide for themselves if a tongue piercing is suitable while also claiming to value the judgement of young people by making them their own young people's parliament.\n \n\n\n\n \"It's a great shame that these young people will not be able to interact within a model parliament that actually represents the Senedd and will not operate transparently. Some of these young people will already have some party affiliation or wish to be a candidate for one, those voting to elect members deserve to know if that candidate has affiliations with Labour, Conservatives, Plaid Cymru, UKIP... or the National Front for instance.\n \n\n\n\n \"A party declaration would also give an indication on what priorities that young person would have, for example a Pirate Party candidate would want to\n [invest in teachers](/policy/education/invest-teachers) \n and let all schools access a\n [national media library](/policy/education/let-all-schools-access-national-media-library) \n . PPUK have also been long standing supporters of\n [votes at 16](/policy/restoring-trust-government/votes-16) \n and would give consideration to\n [allowing some to leave school at 14](/policy/education/reduce-school-leaving-age) \n .\n \n\n\n\n Party disclosure is a useful tool for the electorate.\"\n \n\n\n\n Pirate Party UK Spokesperson for Wales, David A Elston said:\n \n\n\n\n \"Many of those going into the WYP will still be in education and naturally much debate will surround that sector. Education is a devolved sector in Wales, but despite this, the way our schools are run has not been brought into the 21st century. While expensive IT equipment such as top of the range Mac computers and ipads are in schools, seldom are they used when compared to a pencil or any other out of date equipment. It is no longer acceptable in the workplace to use pen and paper, instead everything is documented on a computer, or is later transferred on to one. The default teaching still being pen and paper, is wildly out of date.\n \n\n\n\n \"While the introduction of computing in early years has moved on, where now it should be reasonably common for someone 8 years old to have some kind of very simple programming lessons, there's nothing like a raspberry pi in sight and teaching staff frequently still struggle with basics, such as how to attach a PDF to an e-mail. In order for our children to be computer literate, they need to be supported by\n [qualified teaching staff](/policy/education/ensure-teachers-are-qualified-teach) \n .\"\n \n\n\n\n Likely partly due to these issues, the Pirate Party has enjoyed some success here in Wales. The party has contested national elections in Bridgend, Cardiff, Swansea and the Vale of Glamorgan while steadily increasing their votes, gaining 7.6% in a local VoG election, which was higher than previous attempts by Plaid Cymru and the Liberal Democrats.\n \n\n\n\n Now the party is looking to recruit new volunteers to build and operate local branches and contribute to holding our devolved government to account.\n \n\n\n\n ---\n   \n\n About Pirate Party UK\n \n\n\n\n The Pirate Party in the UK is a fledgling political party. It has fielded a few candidates in European and National elections, but like most small parties it is significantly constrained by the UK electoral system. Despite this, the Pirate Party has started to poll alongside major parties and is looking to build support from the grassroots. The party stood 10 candidates in the June 2017 General Election, and continually polls higher at each election.\n \n\n\n\n Find out more about the UK Pirate Party at\n <https://pirateparty.org.uk/>\n or contact\n [[email protected]](/cdn-cgi/l/email-protection)\n\n\n\n\n\n\n", "summery": "\n\n\n If you live in Wales, are aged 11-18 and want to take part in the Welsh Youth Parliament you will not be allowed to disclose your party affiliation.\n \n\n\n\n The Welsh Government announced the end to their consultation in November 2017 and have decided on the particulars surrounding the Welsh Youth Parliament, despite never publishing the results of the consultation.\n \n\n\n\n Those aged 11-18 are permitted to take part, the first elections will be November 2018 and there will be 60 members but none are allowed to disclose their party association(s). Indeed it is unclear if any register of...\n \n\n\n\n\n", "tags": [], "source": [], "url": "https://www.pirateparty.org.uk/press/young-people-not-permitted-be-party-political-wales-pirates-think-differently", "where": "https://web.archive.org/web/20190414152001/https://www.pirateparty.org.uk/press/young-people-not-permitted-be-party-political-wales-pirates-think-differently", "name": "Mark Chapman / David A Elston", "email": "[email protected]", "date": "2018-04-01T13:00:00+01:00"}, "/press-hit/press-hit-should-all-internet-data-be-treated-same": {"state": "full", "title": "Press Hit: Should all internet data be treated the same?", "body": "\n\n\n\n Is the internet about to change forever? Could removing net neutrality rules turn it into a place of the ‘haves’ and the ‘have-nots’, where rich firms pay for their content to join fast lanes while the rest get left behind? Or will the consumer get more choice on a faster internet?\n \n\n\n\n Donald Trump and his team have recently overturned Obama-era rules on net neutrality, and that means internet providers can offer fast lanes where richer companies pay for the best connections to their consumers.The question is - does that mean rich firms have an advantage over new companies who can’t afford to overtake?\n \n\n\n\n At the Roundtable was Emily Taylor, Editor of the Journal of Cyber Policy; Mark Chapman, from the UK Pirate Party; Sam Dumitriu, Head of Research at the Adam Smith Institute; and Ian Walden, Head of the Institute of Computer and Communications Law at Queen Mary, University of London.\n \n\n\n\n Roundtable is a discussion programme with an edge. Broadcast out of London and presented by David Foster, it's about bringing people to the table, listening to every opinion, and analysing every point of view. From fierce debate to reflective thinking, Roundtable discussions offer a different perspective on the issues that matter to you. Watch it every weekday at 15:30 GMT on TRT World.\n \n\n\n\n\n\n", "summery": "", "tags": ["Net Neutrality", "Mark Chapman", "TRT World"], "source": ["https://youtu.be/8aB-FwR02YM"], "url": "https://www.pirateparty.org.uk/press-hit/press-hit-should-all-internet-data-be-treated-same", "where": "https://web.archive.org/web/20190414152001/https://www.pirateparty.org.uk/press-hit/press-hit-should-all-internet-data-be-treated-same", "date": "2018-04-05T16:30:00+01:00"}}